Revit 2027 API
PipeFittingAndAccessoryData.GetEntity Method
 Returns an Entity of the Schema of the serverGUID.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Entity GetEntity()
Public Function GetEntity As Entity
public:
Entity^ GetEntity()
member GetEntity : unit -> Entity
Return Value
Entity
 The Entity.
Remarks
 The Entity that is returned is a copy of the stored data (with copy-on-write optimization). Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace